# YOLO26s with ECA, BiFPN, and P2 head
nc: 4
scales:
  s: [0.5, 0.5, 1024]

backbone:
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] # 2
  - [-1, 1, ECAAttention, [256]] # 3 ECA after C3k2
  - [-1, 1, Conv, [256, 3, 2]] # 4-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 5
  - [-1, 1, ECAAttention, [512]] # 6 ECA after C3k2
  - [-1, 1, Conv, [512, 3, 2]] # 7-P4/16
  - [-1, 2, C3k2, [512, True]] # 8
  - [-1, 1, ECAAttention, [512]] # 9 ECA after C3k2
  - [-1, 1, Conv, [1024, 3, 2]] # 10-P5/32
  - [-1, 2, C3k2, [1024, True]] # 11
  - [-1, 1, SPPF, [1024, 5]] # 12
  - [-1, 2, C2PSA, [1024]] # 13

head:
  # BiFPN Top-Down
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 14 P5->P4
  - [[-1, 9], 1, BiFPN_Concat, [1]] # 15 P4 fusion
  - [-1, 2, C3k2, [512, True]] # 16

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 17 P4->P3
  - [[-1, 6], 1, BiFPN_Concat, [1]] # 18 P3 fusion
  - [-1, 2, C3k2, [256, True]] # 19

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 20 P3->P2
  - [[-1, 3], 1, BiFPN_Concat, [1]] # 21 P2 fusion
  - [-1, 2, C3k2, [128, True]] # 22 (P2 detection layer)

  # BiFPN Bottom-Up
  - [-1, 1, Conv, [128, 3, 2]] # 23 P2->P3
  - [[-1, 19, 6], 1, BiFPN_Concat_3, [1]] # 24 P3 fusion (3-way)
  - [-1, 2, C3k2, [256, True]] # 25

  - [-1, 1, Conv, [256, 3, 2]] # 26 P3->P4
  - [[-1, 16, 9], 1, BiFPN_Concat_3, [1]] # 27 P4 fusion (3-way)
  - [-1, 2, C3k2, [512, True]] # 28

  - [-1, 1, Conv, [512, 3, 2]] # 29 P4->P5
  - [[-1, 13], 1, BiFPN_Concat, [1]] # 30 P5 fusion
  - [-1, 2, C3k2, [1024, True]] # 31

  - [[22, 25, 28, 31], 1, Detect, [nc]] # 32 Detect (P2, P3, P4, P5)
